Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 400, 22)]         0         
_________________________________________________________________
in_dist (TimeDistributed)    (None, 400, 32)           736       
_________________________________________________________________
enc_bd_0 (Bidirectional)     (None, 400, 64)           16640     
_________________________________________________________________
enc_bnorm_0 (BatchNormalizat (None, 400, 64)           256       
_________________________________________________________________
dropout (Dropout)            (None, 400, 64)           0         
_________________________________________________________________
enc_bd_1 (Bidirectional)     (None, 400, 64)           24832     
_________________________________________________________________
enc_bnorm_1 (BatchNormalizat (None, 400, 64)           256       
_________________________________________________________________
dropout_1 (Dropout)          (None, 400, 64)           0         
_________________________________________________________________
enc_bd_2 (Bidirectional)     (None, 400, 64)           24832     
_________________________________________________________________
enc_bnorm_2 (BatchNormalizat (None, 400, 64)           256       
_________________________________________________________________
dropout_2 (Dropout)          (None, 400, 64)           0         
_________________________________________________________________
enc_bd_3 (Bidirectional)     (None, 400, 64)           24832     
_________________________________________________________________
enc_bnorm_3 (BatchNormalizat (None, 400, 64)           256       
_________________________________________________________________
dropout_3 (Dropout)          (None, 400, 64)           0         
_________________________________________________________________
enc_bd_4 (Bidirectional)     (None, 400, 64)           24832     
_________________________________________________________________
enc_bnorm_4 (BatchNormalizat (None, 400, 64)           256       
_________________________________________________________________
dropout_4 (Dropout)          (None, 400, 64)           0         
_________________________________________________________________
enc_bd_5 (Bidirectional)     (None, 64)                24832     
_________________________________________________________________
enc_bnorm_5 (BatchNormalizat (None, 64)                256       
_________________________________________________________________
dropout_5 (Dropout)          (None, 64)                0         
_________________________________________________________________
latent_projection (Dense)    (None, 32)                2080      
_________________________________________________________________
repeat_vector (RepeatVector) (None, 400, 32)           0         
_________________________________________________________________
dec_bd_0 (Bidirectional)     (None, 400, 64)           16640     
_________________________________________________________________
dec_bnorm_0 (BatchNormalizat (None, 400, 64)           256       
_________________________________________________________________
dec_bd_1 (Bidirectional)     (None, 400, 64)           24832     
_________________________________________________________________
dec_bnorm_1 (BatchNormalizat (None, 400, 64)           256       
_________________________________________________________________
dec_bd_2 (Bidirectional)     (None, 400, 64)           24832     
_________________________________________________________________
dec_bnorm_2 (BatchNormalizat (None, 400, 64)           256       
_________________________________________________________________
dec_bd_3 (Bidirectional)     (None, 400, 64)           24832     
_________________________________________________________________
dec_bnorm_3 (BatchNormalizat (None, 400, 64)           256       
_________________________________________________________________
dec_bd_4 (Bidirectional)     (None, 400, 64)           24832     
_________________________________________________________________
dec_bnorm_4 (BatchNormalizat (None, 400, 64)           256       
_________________________________________________________________
dec_bd_5 (Bidirectional)     (None, 400, 64)           24832     
_________________________________________________________________
dec_bnorm_5 (BatchNormalizat (None, 400, 64)           256       
_________________________________________________________________
out_dist (TimeDistributed)   (None, 400, 22)           1430      
=================================================================
Total params: 288,918
Trainable params: 287,382
Non-trainable params: 1,536
_________________________________________________________________
