Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 400, 22)]         0         
_________________________________________________________________
in_dist (TimeDistributed)    (None, 400, 256)          5888      
_________________________________________________________________
enc_bd_0 (Bidirectional)     (None, 400, 512)          1050624   
_________________________________________________________________
enc_bnorm_0 (BatchNormalizat (None, 400, 512)          2048      
_________________________________________________________________
dropout (Dropout)            (None, 400, 512)          0         
_________________________________________________________________
enc_bd_1 (Bidirectional)     (None, 512)               1574912   
_________________________________________________________________
enc_bnorm_1 (BatchNormalizat (None, 512)               2048      
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
latent_projection (Dense)    (None, 256)               131328    
_________________________________________________________________
repeat_vector (RepeatVector) (None, 400, 256)          0         
_________________________________________________________________
dec_bd_0 (Bidirectional)     (None, 400, 512)          1050624   
_________________________________________________________________
dec_bnorm_0 (BatchNormalizat (None, 400, 512)          2048      
_________________________________________________________________
dec_bd_1 (Bidirectional)     (None, 400, 512)          1574912   
_________________________________________________________________
dec_bnorm_1 (BatchNormalizat (None, 400, 512)          2048      
_________________________________________________________________
out_dist (TimeDistributed)   (None, 400, 22)           11286     
=================================================================
Total params: 5,407,766
Trainable params: 5,403,670
Non-trainable params: 4,096
_________________________________________________________________
