Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 400, 22)]         0         
_________________________________________________________________
in_dist (TimeDistributed)    (None, 400, 128)          2944      
_________________________________________________________________
enc_bd_0 (Bidirectional)     (None, 400, 256)          263168    
_________________________________________________________________
enc_bnorm_0 (BatchNormalizat (None, 400, 256)          1024      
_________________________________________________________________
dropout (Dropout)            (None, 400, 256)          0         
_________________________________________________________________
enc_bd_1 (Bidirectional)     (None, 400, 192)          271104    
_________________________________________________________________
enc_bnorm_1 (BatchNormalizat (None, 400, 192)          768       
_________________________________________________________________
dropout_1 (Dropout)          (None, 400, 192)          0         
_________________________________________________________________
enc_bd_2 (Bidirectional)     (None, 400, 128)          131584    
_________________________________________________________________
enc_bnorm_2 (BatchNormalizat (None, 400, 128)          512       
_________________________________________________________________
dropout_2 (Dropout)          (None, 400, 128)          0         
_________________________________________________________________
enc_bd_3 (Bidirectional)     (None, 64)                41216     
_________________________________________________________________
enc_bnorm_3 (BatchNormalizat (None, 64)                256       
_________________________________________________________________
dropout_3 (Dropout)          (None, 64)                0         
_________________________________________________________________
latent_projection (Dense)    (None, 32)                2080      
_________________________________________________________________
repeat_vector (RepeatVector) (None, 400, 32)           0         
_________________________________________________________________
dec_bd_0 (Bidirectional)     (None, 400, 64)           16640     
_________________________________________________________________
dec_bnorm_0 (BatchNormalizat (None, 400, 64)           256       
_________________________________________________________________
dec_bd_1 (Bidirectional)     (None, 400, 128)          66048     
_________________________________________________________________
dec_bnorm_1 (BatchNormalizat (None, 400, 128)          512       
_________________________________________________________________
dec_bd_2 (Bidirectional)     (None, 400, 192)          172800    
_________________________________________________________________
dec_bnorm_2 (BatchNormalizat (None, 400, 192)          768       
_________________________________________________________________
dec_bd_3 (Bidirectional)     (None, 400, 256)          328704    
_________________________________________________________________
dec_bnorm_3 (BatchNormalizat (None, 400, 256)          1024      
_________________________________________________________________
out_dist (TimeDistributed)   (None, 400, 22)           5654      
=================================================================
Total params: 1,307,062
Trainable params: 1,304,502
Non-trainable params: 2,560
_________________________________________________________________
