Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 400, 22)]         0         
_________________________________________________________________
in_dist (TimeDistributed)    (None, 400, 256)          5888      
_________________________________________________________________
enc_bd_0 (Bidirectional)     (None, 400, 512)          1050624   
_________________________________________________________________
enc_bnorm_0 (BatchNormalizat (None, 400, 512)          2048      
_________________________________________________________________
dropout (Dropout)            (None, 400, 512)          0         
_________________________________________________________________
enc_bd_1 (Bidirectional)     (None, 256)               656384    
_________________________________________________________________
enc_bnorm_1 (BatchNormalizat (None, 256)               1024      
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
latent_projection (Dense)    (None, 128)               32896     
_________________________________________________________________
repeat_vector (RepeatVector) (None, 400, 128)          0         
_________________________________________________________________
dec_bd_0 (Bidirectional)     (None, 400, 256)          263168    
_________________________________________________________________
dec_bnorm_0 (BatchNormalizat (None, 400, 256)          1024      
_________________________________________________________________
dec_bd_1 (Bidirectional)     (None, 400, 512)          1050624   
_________________________________________________________________
dec_bnorm_1 (BatchNormalizat (None, 400, 512)          2048      
_________________________________________________________________
out_dist (TimeDistributed)   (None, 400, 22)           11286     
=================================================================
Total params: 3,077,014
Trainable params: 3,073,942
Non-trainable params: 3,072
_________________________________________________________________
