Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 400, 22)]         0         
_________________________________________________________________
in_dist (TimeDistributed)    (None, 400, 128)          2944      
_________________________________________________________________
enc_bd_0 (Bidirectional)     (None, 400, 256)          263168    
_________________________________________________________________
enc_bnorm_0 (BatchNormalizat (None, 400, 256)          1024      
_________________________________________________________________
dropout (Dropout)            (None, 400, 256)          0         
_________________________________________________________________
enc_bd_1 (Bidirectional)     (None, 400, 256)          394240    
_________________________________________________________________
enc_bnorm_1 (BatchNormalizat (None, 400, 256)          1024      
_________________________________________________________________
dropout_1 (Dropout)          (None, 400, 256)          0         
_________________________________________________________________
enc_bd_2 (Bidirectional)     (None, 256)               394240    
_________________________________________________________________
enc_bnorm_2 (BatchNormalizat (None, 256)               1024      
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
latent_projection (Dense)    (None, 64)                16448     
_________________________________________________________________
repeat_vector (RepeatVector) (None, 400, 64)           0         
_________________________________________________________________
dec_bd_0 (Bidirectional)     (None, 400, 256)          197632    
_________________________________________________________________
dec_bnorm_0 (BatchNormalizat (None, 400, 256)          1024      
_________________________________________________________________
dec_bd_1 (Bidirectional)     (None, 400, 256)          394240    
_________________________________________________________________
dec_bnorm_1 (BatchNormalizat (None, 400, 256)          1024      
_________________________________________________________________
dec_bd_2 (Bidirectional)     (None, 400, 256)          394240    
_________________________________________________________________
dec_bnorm_2 (BatchNormalizat (None, 400, 256)          1024      
_________________________________________________________________
out_dist (TimeDistributed)   (None, 400, 22)           5654      
=================================================================
Total params: 2,068,950
Trainable params: 2,065,878
Non-trainable params: 3,072
_________________________________________________________________
