Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 400, 22)]         0         
_________________________________________________________________
in_dist (TimeDistributed)    (None, 400, 64)           1472      
_________________________________________________________________
enc_bd_0 (Bidirectional)     (None, 400, 128)          66048     
_________________________________________________________________
enc_bnorm_0 (BatchNormalizat (None, 400, 128)          512       
_________________________________________________________________
dropout (Dropout)            (None, 400, 128)          0         
_________________________________________________________________
enc_bd_1 (Bidirectional)     (None, 400, 128)          98816     
_________________________________________________________________
enc_bnorm_1 (BatchNormalizat (None, 400, 128)          512       
_________________________________________________________________
dropout_1 (Dropout)          (None, 400, 128)          0         
_________________________________________________________________
enc_bd_2 (Bidirectional)     (None, 400, 128)          98816     
_________________________________________________________________
enc_bnorm_2 (BatchNormalizat (None, 400, 128)          512       
_________________________________________________________________
dropout_2 (Dropout)          (None, 400, 128)          0         
_________________________________________________________________
enc_bd_3 (Bidirectional)     (None, 128)               98816     
_________________________________________________________________
enc_bnorm_3 (BatchNormalizat (None, 128)               512       
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
latent_projection (Dense)    (None, 128)               16512     
_________________________________________________________________
repeat_vector (RepeatVector) (None, 400, 128)          0         
_________________________________________________________________
dec_bd_0 (Bidirectional)     (None, 400, 128)          98816     
_________________________________________________________________
dec_bnorm_0 (BatchNormalizat (None, 400, 128)          512       
_________________________________________________________________
dec_bd_1 (Bidirectional)     (None, 400, 128)          98816     
_________________________________________________________________
dec_bnorm_1 (BatchNormalizat (None, 400, 128)          512       
_________________________________________________________________
dec_bd_2 (Bidirectional)     (None, 400, 128)          98816     
_________________________________________________________________
dec_bnorm_2 (BatchNormalizat (None, 400, 128)          512       
_________________________________________________________________
dec_bd_3 (Bidirectional)     (None, 400, 128)          98816     
_________________________________________________________________
dec_bnorm_3 (BatchNormalizat (None, 400, 128)          512       
_________________________________________________________________
out_dist (TimeDistributed)   (None, 400, 22)           2838      
=================================================================
Total params: 782,678
Trainable params: 780,630
Non-trainable params: 2,048
_________________________________________________________________
