_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 400, 22)]         0
_________________________________________________________________
in_dist (TimeDistributed)    (None, 400, 64)           1472
_________________________________________________________________
enc_lstm_0 (LSTM)            (None, 400, 64)           33024
_________________________________________________________________
enc_bnorm_0 (BatchNormalizat (None, 400, 64)           256
_________________________________________________________________
enc_lstm_1 (LSTM)            (None, 400, 64)           33024
_________________________________________________________________
enc_bnorm_1 (BatchNormalizat (None, 400, 64)           256
_________________________________________________________________
enc_lstm_2 (LSTM)            (None, 64)                33024
_________________________________________________________________
enc_bnorm_2 (BatchNormalizat (None, 64)                256
_________________________________________________________________
latent_projection (Dense)    (None, 32)                2080
_________________________________________________________________
repeat_vector (RepeatVector) (None, 400, 32)           0
_________________________________________________________________
dec_lstm_0 (LSTM)            (None, 400, 64)           24832
_________________________________________________________________
dec_bnorm_0 (BatchNormalizat (None, 400, 64)           256
_________________________________________________________________
dec_lstm_1 (LSTM)            (None, 400, 64)           33024
_________________________________________________________________
dec_bnorm_1 (BatchNormalizat (None, 400, 64)           256
_________________________________________________________________
dec_lstm_2 (LSTM)            (None, 400, 64)           33024
_________________________________________________________________
dec_bnorm_2 (BatchNormalizat (None, 400, 64)           256
_________________________________________________________________
out_dist (TimeDistributed)   (None, 400, 22)           1430
=================================================================
Total params: 196,470
Trainable params: 195,702
Non-trainable params: 768
_________________________________________________________________
